app/controllers/sessions_controller.rb

  def create
    user = User.find_or_create_by(:uid => auth['uid']) do |u|
---
INSERT INTO "users" ("uid", "name", "email") VALUES (?, ?, ?)  [["uid", 10154570028708348], ["name", "Siobhan Harley Kavanaugh"], ["email", "siobhan.harley@gmail.com"]]
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT 1  [["uid", 1]]